tests/performance/userTest.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 30
      arrivalRate: 100
scenarios:
  - flow:
      - get:
          url: "/users/duplicationCheck/testuser{{ $randomString(5) }}"
          capture:
            path: "url"
            regex: "testuser([A-Za-z0-9]{5})"
            as: "account"
      - post:
          url: "/users/signup"
          json:
            account: "{{ account }}"
            password: "Test{{ $randomString(5) }}!@#123"
            nickname: "TestUser"
            question_answer: "TestAnswer"
          capture:
            json: "$.password"
            as: "password"
      - post:
          url: "/users/signin"
          json:
            account: "precreated_user"
            password: "precreated_password"
          capture:
            json: "$.access_token"
            as: "access_token"
      - delete:
          url: "/users/logout"
          headers:
            Authorization: "Bearer {{ access_token }}"
          json:
            account: "precreated_user"